Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
/*
 * ============================================================================
 *  SERRA SMART — PONTE LoRa <-> WiFi/MQTT  (ESP32 in camera)
 * ============================================================================
 *
 *  Versione in config.h (FW_VERSION_PONTE) — vedi docs/Guida_Serra_Smart.md
 *  e docs/PROTOCOLLO.md
 *
 *  ---------------------------------------------------------------------------
 *  COMPITI
 *  ---------------------------------------------------------------------------
 *   - Restare SEMPRE in ascolto LoRa: il nodo trasmette per pochi secondi ogni
 *     15 minuti, non possiamo permetterci di perdere quella finestra
 *   - Pubblicare ogni pacchetto su MQTT e rispondere con un ACK SOLO quando il
 *     broker ha confermato di averlo ricevuto (eco di conferma), cosi' un dato
 *     non arrivato resta al sicuro sulla microSD della serra
 *   - Consegnare al nodo i comandi che Home Assistant ha messo in coda,
 *     agganciandoli all'ACK: e' l'unico momento in cui la serra ascolta
 *   - Allegare a ogni ACK l'ora NTP, cosi' il DS1307 della serra si
 *     risincronizza da solo quando la batteria tampone si scarica
 *   - Generare da solo le entita' di Home Assistant, comprese quelle nuove
 *     che non conosce (discovery generica)
 *   - Riconnettersi ad automaticamente a WiFi e MQTT senza mai smettere di
 *     ascoltare la radio
 *
 *  ---------------------------------------------------------------------------
 *  LIBRERIE NECESSARIE
 *  ---------------------------------------------------------------------------
 *    - "LoRa" by Sandeep Mistry
 *    - "PubSubClient" by Nick O'Leary
 *
 *  PRIMA DI COMPILARE: copia secrets.h.example in secrets.h e compilalo.
 *
 *  Scheda: "ESP32 Dev Module"
 * ============================================================================
 */

#include <WiFi.h>
#include <PubSubClient.h>
#include <SPI.h>
#include <LoRa.h>
#include <esp_task_wdt.h>
#include <time.h>

#include "config.h"
#include "secrets.h"
#include "protocollo.h"
#include "discovery.h"
#include "comandi.h"

#if ABILITA_OTA
  #include <ArduinoOTA.h>
#endif

#ifndef ESP_ARDUINO_VERSION_VAL
  #define ESP_ARDUINO_VERSION_VAL(a, b, c) (((a) << 16) | ((b) << 8) | (c))
#endif
#ifndef ESP_ARDUINO_VERSION
  #define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(2, 0, 0)
#endif

// ============================ GLOBALI =======================================

WiFiClient   espClient;
PubSubClient mqtt(espClient);

static uint32_t ultimoTentativoWifi = 0;
static uint32_t ultimoTentativoMqtt = 0;
static uint32_t ultimaDiagnostica   = 0;
static uint32_t ultimaDiscovery     = 0;   // 0 = mai pubblicata
static uint32_t wifiGiuDa           = 0;

static uint32_t riconnessioniWifi   = 0;
static uint32_t riconnessioniMqtt   = 0;
static uint32_t pacchettiRicevuti   = 0;
static uint32_t pacchettiScartati   = 0;
static uint32_t comandiConsegnati   = 0;
static int      ultimoRssi          = 0;
static float    ultimoSnr           = 0.0f;

/*
 * Perche' e' caduta l'ultima connessione MQTT, e con che segnale WiFi.
 *
 * Finora si sapeva solo QUANTE volte era caduta. Il log del broker diceva
 * sempre "exceeded timeout", cioe' "non ho piu' ricevuto niente da te", e
 * da li' non si poteva distinguere fra due cose molto diverse: il ponte che
 * smette di trasmettere, e il ponte che trasmette senza che arrivi.
 *
 * mqtt.state() letto NEL MOMENTO in cui ci si accorge della caduta separa i
 * due casi: -4 (timeout) significa che e' stato il ponte a chiudere perche'
 * il suo ping non ha avuto risposta, -3 (lost) che se l'e' vista chiudere
 * sotto. Il RSSI dello stesso istante dice se quando succede il segnale era
 * gia' in difficolta'.
 */
static int      statoUltimaCaduta   = 0;
static int      rssiUltimaCaduta    = 0;

// Anti-duplicati: il nodo ritrasmette se l'ACK si perde, e senza questo
// controllo il dato finirebbe due volte nello storico e nel totale dell'acqua.
struct ChiaveDedup { uint32_t seq; uint32_t ts; };
static ChiaveDedup dedup[DEDUP_MEMORIA];
static uint8_t     dedupIdx = 0;

// Eco di conferma (vedi confermaDalBroker()). Il gettone atteso cambia a ogni
// pacchetto, cosi' un'eco in ritardo di un giro precedente non conferma
// quello attuale.
static char     ecoAtteso[24]  = "";
static bool     ecoTornato     = false;
static uint32_t ecoMancate     = 0;    // pacchetti rimasti senza ACK per eco mancata
static uint32_t ultimaEcoMs    = 0;    // tempo di andata e ritorno dell'ultima eco

// Timestamp dell'ultimo pacchetto FRESCO confermato dal broker (0 = nessuno
// dall'avvio). Vedi STORICO_MARGINE_SEC in config.h.
static uint32_t ultimoTsFresco = 0;

/*
 * L'ultimo comando consegnato dentro un ACK, con il pacchetto a cui era
 * allegato.
 *
 * Il comando esce dalla coda quando parte l'ACK. Se il nodo quell'ACK non lo
 * sente, ritrasmette lo stesso pacchetto: prima gli si rispondeva con un ACK
 * nudo, e il comando era perso senza che nessuno lo eseguisse. Ora, per quella
 * sola ritrasmissione, gli si riallega lo stesso comando. Resta "al massimo
 * una volta": il nodo elabora un solo ACK per ogni numero di sequenza.
 */
static bool          ackCmdValido = false;
static uint32_t      ackCmdSeq    = 0;
static uint32_t      ackCmdTs     = 0;
static uint32_t      ackCmdMs     = 0;
static ComandoInCoda ackCmd;

// ============================ WATCHDOG ======================================

static void wdtImposta(uint32_t secondi) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_task_wdt_config_t cfg = {};
  cfg.timeout_ms     = secondi * 1000UL;
  cfg.idle_core_mask = 0;
  cfg.trigger_panic  = true;
  // Si prova PRIMA a riconfigurare e solo dopo a inizializzare.
  // Nel core ESP32 3.x il TWDT e' gia' avviato dal framework, quindi init()
  // per primo fallisce sempre e stampa un "E (...) task_wdt: TWDT already
  // initialized" rosso nel log di avvio: sembra un guasto grave e invece e'
  // rumore. Correzione gia' applicata al nodo in watchdog.h; qui il ponte
  // aveva la sua copia locale ed era rimasta indietro.
  esp_err_t e = esp_task_wdt_reconfigure(&cfg);
  if (e == ESP_ERR_INVALID_STATE) e = esp_task_wdt_init(&cfg);
  if (e != ESP_OK) Serial.printf("[WDT] Configurazione fallita (err=%d)\n", (int)e);
#else
  esp_task_wdt_init(secondi, true);
#endif
  // Anche qui: iscrivere un task gia' iscritto stampa un altro errore rosso.
  if (esp_task_wdt_status(NULL) != ESP_OK) esp_task_wdt_add(NULL);
}

// ============================ WIFI ==========================================

