Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
/*
 * Scansione delle reti visibili, stampata all'avvio.
 *
 * Serve a scegliere l'access point guardando i numeri invece che a intuito:
 * il segnale va misurato DALLA POSIZIONE DEL PONTE, non da dove sei tu col
 * telefono. Mostra anche se la rete configurata e' effettivamente visibile,
 * il che smaschera subito i due errori piu' comuni: SSID scritto male e rete
 * a 5 GHz, che l'ESP32 non puo' vedere perche' ha solo la radio a 2,4 GHz.
 */
#if SCANSIONE_WIFI_AVVIO
static void wifiScansione() {
  Serial.println(F("[WiFi] Scansione delle reti visibili da qui..."));
  int n = WiFi.scanNetworks();

  if (n <= 0) {
    Serial.println(F("[WiFi] Nessuna rete trovata."));
    return;
  }

  bool trovataLaNostra = false;
  Serial.println(F("       RSSI  canale  SSID"));
  for (int i = 0; i < n && i < 12; i++) {
    bool nostra = (WiFi.SSID(i) == WIFI_SSID);
    if (nostra) trovataLaNostra = true;
    Serial.printf("      %4d  %6d  %s%s\n", WiFi.RSSI(i), WiFi.channel(i),
                  WiFi.SSID(i).c_str(), nostra ? "   <== configurata" : "");
  }

  if (!trovataLaNostra) {
    Serial.printf("[WiFi] ATTENZIONE: \"%s\" non e' fra le reti visibili.\n", WIFI_SSID);
    Serial.println(F("[WiFi] Controlla il nome (occhio a maiuscole e spazi) e"));
    Serial.println(F("[WiFi] ricorda che l'ESP32 vede SOLO i 2,4 GHz, mai i 5 GHz."));
  }
  WiFi.scanDelete();
}
#endif

static void wifiSetup() {
  WiFi.mode(WIFI_STA);
#if SCANSIONE_WIFI_AVVIO
  wifiScansione();
#endif
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  /*
   * Modem-sleep DISATTIVATO, e non e' un dettaglio.
   *
   * Con il modem-sleep la radio WiFi si spegne a intervalli per risparmiare
   * corrente. Su un dispositivo a batteria ha senso; qui il ponte sta attaccato
   * a un alimentatore USB e il risparmio non serve a nulla, mentre il prezzo e'
   * alto: la connessione TCP verso il broker cade in silenzio ogni tanto, e
   * quando il ponte si riconnette il broker pubblica il Last Will della
   * sessione morta. Risultato in Home Assistant: tutte le entita' della serra
   * diventano "non disponibile" per un secondo e poi tornano, a ripetizione.
   */
  WiFi.setSleep(false);
  WiFi.setHostname(OTA_HOSTNAME);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  Serial.printf("[WiFi] Connessione a %s ...\n", WIFI_SSID);
}

// Non bloccante: il LoRa deve continuare ad ascoltare anche mentre il WiFi
// e' giu'. Nessuna delle funzioni chiamate qui puo' fermare il loop.
static void wifiMantieni() {
  if (WiFi.status() == WL_CONNECTED) {
    if (wifiGiuDa != 0) {
      // Stesso ragionamento del contatore MQTT: all'avvio il WiFi risulta
      // "giu'" per i primi secondi, prima ancora di essersi mai collegato.
      // Quell'aggancio iniziale non e' una riconnessione.
      static bool primoAggancio = true;
      if (primoAggancio) primoAggancio = false;
      else               riconnessioniWifi++;

      int rssi = WiFi.RSSI();
      Serial.printf("[WiFi] Connesso dopo %lu s: %s (RSSI %d dBm) - riconnessioni: %lu\n",
                    (unsigned long)((millis() - wifiGiuDa) / 1000UL),
                    WiFi.localIP().toString().c_str(), rssi,
                    (unsigned long)riconnessioniWifi);

      // Segnalato all'avvio invece di lasciarlo scoprire dai sintomi: sotto
      // questa soglia le cadute di connessione sono attese, non un guasto.
      if (rssi < WIFI_RSSI_DEBOLE)
        Serial.printf("[WiFi] ATTENZIONE: %d dBm e' un segnale debole. Aspettati "
                      "riconnessioni: avvicina il ponte o cambia access point.\n", rssi);

      wifiGiuDa = 0;
    }
    return;
  }

  if (wifiGiuDa == 0) wifiGiuDa = millis();

  /*
   * Riavvio SOLO se il WiFi resta giu' a lungo, non piu' a intervalli fissi.
   * La versione precedente faceva ESP.restart() ogni ora a prescindere:
   * durante i secondi di riavvio la radio non ascolta, e con il nodo che
   * trasmette ogni 15 minuti c'era una probabilita' concreta di perdere
   * proprio quel pacchetto.
   */
  if (millis() - wifiGiuDa > REBOOT_WIFI_DOWN_MS) {
    Serial.println(F("[WiFi] Giu' da troppo tempo: riavvio il ponte."));
    delay(500);
    ESP.restart();
  }

  if (millis() - ultimoTentativoWifi < WIFI_RETRY_MS) return;
  ultimoTentativoWifi = millis();

  Serial.println(F("[WiFi] Disconnesso, ritento..."));
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASS);
}

// ============================ ORA (NTP) =====================================

// L'ora del ponte viaggia su ogni ACK ed e' quella con cui la serra corregge
// il proprio DS1307: e' l'unico orologio affidabile del sistema.
static uint32_t oraCorrente() {
  time_t adesso = time(nullptr);
  return (adesso > 1700000000L) ? (uint32_t)adesso : 0;
}

/*
 * Scarto in secondi fra l'ora civile e UTC in questo istante: +7200 con l'ora
 * legale, +3600 con quella solare.
 *
 * Serve perche' time() restituisce UTC e il nodo scrive quel valore tale e
 * quale nel DS1307, per poi confrontare rtc.now().hour() con l'orario
 * programmato da Home Assistant. Senza questo campo "irriga alle 6:00"
 * significava le 6:00 UTC, cioe' le 8:00 italiane d'estate e le 7:00
 * d'inverno: l'acqua arrivava ogni giorno due ore dopo il previsto.
 *
 * Le regole dell'ora legale stanno solo qui, dentro NTP_TZ, ed e' giusto che
 * ci restino: il nodo non ha ne' modo ne' motivo di conoscerle, gli basta il
 * numero che il ponte gli passa a ogni ACK.
 *
 * Il calcolo NON usa tm_gmtoff: e' un'estensione che newlib espone solo con
 * certe combinazioni di macro di visibilita', e una compilazione che oggi
 * funziona potrebbe smettere di farlo al prossimo aggiornamento del core.
 * Confrontare le due rappresentazioni dello stesso istante e' equivalente e
 * non dipende da nulla.
 */
static int32_t offsetFuso() {
  time_t adesso = time(nullptr);
  if (adesso < 1700000000L) return 0;

  struct tm loc, utc;
  localtime_r(&adesso, &loc);
  gmtime_r   (&adesso, &utc);

  int32_t scarto = (int32_t)(loc.tm_hour - utc.tm_hour) * 3600L
                 + (int32_t)(loc.tm_min  - utc.tm_min ) * 60L
                 + (int32_t)(loc.tm_sec  - utc.tm_sec );

  // Le due date possono cadere a cavallo della mezzanotte: in quel caso la
  // sola differenza oraria e' sbagliata di un giorno intero. Lo scarto fra i
  // giorni dell'anno vale +-1 in condizioni normali e +-364/365 a Capodanno,
  // quando l'anno cambia sotto i piedi al confronto.
  int giorni = loc.tm_yday - utc.tm_yday;
  if (giorni ==  1 || giorni < -1) scarto += 86400L;
  if (giorni == -1 || giorni >  1) scarto -= 86400L;

  return scarto;
}

// ============================ MQTT ==========================================

