Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
static void mqttCallback(char* topic, byte* payload, unsigned int len) {
  // L'eco non e' un comando: va riconosciuta prima di tutto il resto.
  if (strcmp(topic, TOPIC_ECO) == 0) {
    size_t atteso = strlen(ecoAtteso);
    if (atteso > 0 && len == atteso && memcmp(payload, ecoAtteso, len) == 0)
      ecoTornato = true;
    return;
  }
  codaMessaggioMqtt(topic, payload, len);
}

static void mqttMantieni() {
  if (WiFi.status() != WL_CONNECTED) return;

  static bool eraConnesso = false;
  if (mqtt.connected()) { eraConnesso = true; return; }

  // Passaggio da connesso a caduto: e' l'unico istante in cui mqtt.state()
  // contiene ancora il motivo, prima che il tentativo di riconnessione lo
  // sovrascriva con il proprio esito.
  if (eraConnesso) {
    eraConnesso       = false;
    statoUltimaCaduta = mqtt.state();
    rssiUltimaCaduta  = WiFi.RSSI();
    Serial.printf("[MQTT] Connessione caduta (stato=%d, RSSI %d dBm, "
                  "uptime %lu s).\n",
                  statoUltimaCaduta, rssiUltimaCaduta,
                  (unsigned long)(millis() / 1000UL));
  }

  if (millis() - ultimoTentativoMqtt < MQTT_RETRY_MS) return;
  ultimoTentativoMqtt = millis();

  Serial.print(F("[MQTT] Connessione al broker... "));

  // Last Will: se il ponte muore, Home Assistant segna subito le entita'
  // come non disponibili invece di mostrare valori vecchi come se fossero attuali.
  if (mqtt.connect(MQTT_CLIENT_ID, MQTT_USER, MQTT_PASS,
                   TOPIC_PONTE, 1, true, "offline")) {
    // La PRIMA connessione non e' una riconnessione: contarla farebbe
    // sembrare instabile un ponte appena avviato che invece sta benissimo.
    // Questi contatori servono a rispondere a "sta reggendo?", quindi devono
    // partire da zero e restarci finche' non succede davvero qualcosa.
    static bool primaConnessione = true;
    if (primaConnessione) primaConnessione = false;
    else                  riconnessioniMqtt++;

    Serial.printf("OK! (riconnessioni finora: %lu, uptime %lu s)\n",
                  (unsigned long)riconnessioniMqtt,
                  (unsigned long)(millis() / 1000UL));

    /*
     * Algoritmo di Nagle disattivato, e va rifatto a OGNI connessione
     * perche' il socket e' nuovo ogni volta.
     *
     * Nagle trattiene i pacchetti piccoli finche' i dati precedenti non
     * sono stati confermati, per non sprecare rete con tanti invii minuscoli.
     * Il PINGREQ di MQTT e' lungo DUE byte, ed e' esattamente il pacchetto
     * che Nagle ama trattenere. Se la conferma TCP di una pubblicazione
     * tarda -- e con il WiFi tarda spesso, perche' anche dall'altra parte
     * c'e' un ritardo volontario sulle conferme -- il ping resta fermo nel
     * buffer di uscita. Il broker non riceve piu' niente, e dopo una volta e
     * mezza il keepalive chiude la sessione: nel suo log si legge
     * "exceeded timeout", che sembra un ponte morto e invece e' un ponte
     * vivissimo con due byte in ostaggio.
     *
     * Qui non c'e' niente da risparmiare: i messaggi sono pochi e radi.
     */
    espClient.setNoDelay(true);

    mqtt.publish(TOPIC_PONTE, "online", true);
    // Sessione pulita: le sottoscrizioni vanno rifatte a ogni connessione,
    // compresa quella dell'eco, senza la quale nessun ACK partirebbe piu'.
    mqtt.subscribe(TOPIC_ECO, 0);
    mqtt.subscribe(TOPIC_CMD_SUB, 1);
    // Subito dopo la sottoscrizione il broker riversa i messaggi ritenuti:
    // i comandi di azione che arrivano adesso sono residui, non richieste.
    codaSegnalaSottoscrizione();

    /*
     * La discovery NON si ripubblica a ogni riconnessione.
     *
     * Sono tredici messaggi ritenuti da ~400 byte: una raffica di 5 KB spinta
     * nel socket alla massima velocita'. Su un WiFi debole basta a far cadere
     * la connessione appena stabilita, il che provoca una riconnessione, che
     * rilancia la raffica. Nel log del ponte si vedeva nitidamente:
     * connessione riuscita, tredici pubblicazioni, caduta dopo cinque secondi,
     * e tutto da capo.
     *
     * Ripubblicare ogni volta era comunque inutile: quei messaggi sono
     * RITENUTI, quindi e' il broker a conservarli. Serve farlo al primo avvio
     * e, per sicurezza, ogni tanto, nel caso il broker sia stato reinstallato.
     */
    uint32_t adessoMs = millis();
    bool servePubblicare = (ultimaDiscovery == 0) ||
                           (adessoMs - ultimaDiscovery > DISCOVERY_RIPUBBLICA_MS);

    if (servePubblicare) {
      discoveryReset();
      if (discoveryPubblicaComandi() && discoveryPubblicaPonte())
        ultimaDiscovery = adessoMs ? adessoMs : 1;   // 0 e' riservato a "mai"
      else
        Serial.println(F("[HA] Discovery interrotta: riprovo alla prossima connessione."));
    } else {
      Serial.printf("[HA] Discovery gia' pubblicata %lu min fa: la salto.\n",
                    (unsigned long)((adessoMs - ultimaDiscovery) / 60000UL));
    }

    codaPubblicaPending();
  } else {
    Serial.printf("fallita (rc=%d), riprovo tra %lu s.\n",
                  mqtt.state(), MQTT_RETRY_MS / 1000UL);
  }
}

/*
 * Conferma che il broker ha davvero ricevuto quello che gli abbiamo appena
 * pubblicato.
 *
 * mqtt.publish() con QoS 0 restituisce true appena i byte entrano nel buffer
 * TCP dell'ESP32, non quando arrivano al broker. Se in quel momento il
 * collegamento e' in stallo -- e succede 14-22 volte al giorno -- il ponte
 * mandava lo stesso l'ACK, il nodo cancellava il dato, e il broker poco dopo
 * chiudeva la sessione con i byte ancora in viaggio. Dal 13/09, 12 cicli persi
 * su 15 sono caduti esattamente dentro uno di questi stalli, e nessuno era
 * finito nel backlog perche' il nodo l'ACK l'aveva ricevuto.
 *
 * Il rimedio e' un'eco: dopo i dati si pubblica un gettone su un topic a cui
 * il ponte stesso e' iscritto, e si aspetta di vederlo tornare. Viaggia sulla
 * stessa connessione TCP DOPO i dati, e il broker elabora i messaggi di un
 * client nell'ordine in cui arrivano: se ha rimandato indietro l'eco, i dati
 * li ha gia' ricevuti e consegnati. Se l'eco non torna entro ECO_TIMEOUT_MS
 * niente ACK: il nodo ritrasmette o mette il pacchetto nel backlog.
 *
 * Non serve cambiare libreria ne' passare a QoS 1, che PubSubClient in
 * pubblicazione non supporta.
 */
static bool confermaDalBroker(uint32_t seq) {
  snprintf(ecoAtteso, sizeof(ecoAtteso), "%lu-%lu",
           (unsigned long)seq, (unsigned long)millis());
  ecoTornato = false;

  if (!mqtt.publish(TOPIC_ECO, ecoAtteso)) return false;

