Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
  const uint32_t t0 = millis();
  while (!ecoTornato && millis() - t0 < ECO_TIMEOUT_MS) {
    esp_task_wdt_reset();
    if (!mqtt.loop()) break;      // la connessione e' caduta mentre aspettavamo
    delay(1);
  }

  if (ecoTornato) ultimaEcoMs = millis() - t0;
  ecoAtteso[0] = '\0';            // un'eco che arriva dopo non conferma nulla
  return ecoTornato;
}

// ============================ DEDUP =========================================

static bool giaVisto(uint32_t seq, uint32_t ts) {
  for (uint8_t i = 0; i < DEDUP_MEMORIA; i++)
    if (dedup[i].seq == seq && dedup[i].ts == ts) return true;
  return false;
}

static void ricorda(uint32_t seq, uint32_t ts) {
  dedup[dedupIdx].seq = seq;
  dedup[dedupIdx].ts  = ts;
  dedupIdx = (dedupIdx + 1) % DEDUP_MEMORIA;
}

// ============================ JSON ==========================================

// true se la stringa e' un numero valido per intero (e non, per esempio,
// "2.0.0" o "ok", che nel JSON vanno virgolettati).
static bool eNumerico(const char* s) {
  if (!s || !*s) return false;
  char* fine = nullptr;
  strtod(s, &fine);
  return fine && *fine == '\0';
}

/*
 * Converte il pacchetto in JSON copiando OGNI coppia chiave=valore cosi'
 * com'e'. E' qui che si vede il vantaggio del protocollo v2: il ponte non ha
 * bisogno di sapere quali sensori esistono, quindi aggiungerne uno alla serra
 * non richiede di riflashare anche lui.
 */
static size_t costruisciJson(const PacchettoKV& pkt, char* out, size_t maxOut,
                             int rssi, float snr) {
  /*
   * La coda del JSON viene preparata PRIMA e il suo spazio riservato per tutto
   * il ciclo. Non e' pignoleria: se il buffer si riempisse con i campi, la
   * graffa di chiusura verrebbe troncata e Home Assistant scarterebbe l'intero
   * pacchetto come JSON non valido — tutti i sensori fermi, senza un errore
   * che spieghi perche'. Meglio perdere qualche campo che l'intero messaggio.
   */
  char coda[96];
  int  lCoda = snprintf(coda, sizeof(coda),
                        ",\"rssi\":%d,\"snr\":%.1f,\"ts_ponte\":%lu}",
                        rssi, snr, (unsigned long)oraCorrente());
  if (lCoda < 0 || (size_t)lCoda >= sizeof(coda) || maxOut < (size_t)lCoda + 4) {
    out[0] = '\0';
    return 0;
  }

  size_t pos = 0;
  out[pos++] = '{';
  out[pos]   = '\0';

  bool primo = true, tagliato = false;
  char campo[PROTO_LEN_CHIAVE + PROTO_LEN_VALORE + 8];

  for (uint8_t i = 0; i < pkt.n(); i++) {
    const CampoKV& c = pkt.campo(i);

    int l = eNumerico(c.valore)
          ? snprintf(campo, sizeof(campo), "%s\"%s\":%s",
                     primo ? "" : ",", c.chiave, c.valore)
          : snprintf(campo, sizeof(campo), "%s\"%s\":\"%s\"",
                     primo ? "" : ",", c.chiave, c.valore);
    if (l < 0 || (size_t)l >= sizeof(campo)) continue;   // campo anomalo: saltato

    // Il campo ci sta solo se dopo di lui ci sta ancora tutta la coda.
    if (pos + (size_t)l + (size_t)lCoda + 1 > maxOut) { tagliato = true; break; }

    memcpy(out + pos, campo, (size_t)l);
    pos += (size_t)l;
    out[pos] = '\0';
    primo = false;
  }

  // Se non e' entrato nessun campo va tolta la virgola iniziale della coda,
  // o verrebbe fuori {,"rssi":...} che non e' JSON valido.
  const char* codaDa  = primo ? coda + 1 : coda;
  size_t      codaLen = primo ? (size_t)lCoda - 1 : (size_t)lCoda;

  memcpy(out + pos, codaDa, codaLen);
  pos += codaLen;
  out[pos] = '\0';

  if (tagliato)
    Serial.printf("[MQTT] ATTENZIONE: JSON oltre i %u byte, alcuni campi omessi. "
                  "Alza la dimensione del buffer in gestisciLoRa().\n", (unsigned)maxOut);

  return pos;
}

// ============================ LORA ==========================================

/*
 * Costruisce e invia l'ACK. E' il messaggio piu' importante del sistema:
 *   - conferma al nodo che il dato e' arrivato fino al broker
 *   - porta l'ora corrente, con cui la serra corregge il proprio orologio
 *   - porta l'eventuale comando da eseguire
 * Tutto questo senza un solo pacchetto in piu' rispetto a prima.
 */
/*
 * Tempo di volo di un pacchetto, in millisecondi. Formula del datasheet
 * SX1276/78 paragrafo 4.1.1.7: header esplicito, CRC attivo, low data rate
 * optimization spenta. LORA_CR vale gia' 5, cioe' e' il (CR + 4) della
 * formula. Gemella di quella in serra_nodo/radio.cpp, verificata da
 * tools/test_tempo_volo.py.
 */
static uint32_t tempoDiVoloMs(size_t lunghezza) {
  const float tSimbolo = (float)(1UL << LORA_SF) / (float)LORA_BW;   // secondi

  int32_t numeratore   = 8 * (int32_t)lunghezza - 4 * LORA_SF + 28 + 16;
  int32_t denominatore = 4 * LORA_SF;
  int32_t simboli = 8;
  if (numeratore > 0)
    simboli += ((numeratore + denominatore - 1) / denominatore) * LORA_CR;

  const float preambolo = (8.0f + 4.25f) * tSimbolo;
  return (uint32_t)((preambolo + simboli * tSimbolo) * 1000.0f) + 1;
}

/*
 * Trasmette e torna in ascolto, senza attese illimitate.
 *
 * La versione sincrona di LoRa.endPacket() e' un ciclo che aspetta il flag
 * di TxDone senza timeout e senza nutrire il watchdog: sul nodo si e'
 * impiantata piu' volte. Qui si parte in modo asincrono e si chiede a
 * beginPacket() quando il modulo e' di nuovo libero -- risponde 0 finche'
 * trasmette, 1 quando ha finito -- perche' isTransmitting() nella libreria
 * 0.8.0 e' privata. Gli effetti collaterali della chiamata che riesce
 * (standby e puntatori del FIFO azzerati) sono innocui: subito dopo si
 * passa comunque in ricezione.
 */
static void trasmettiAck(const char* pacchetto) {
  LoRa.idle();
  LoRa.beginPacket();
  LoRa.print(pacchetto);
  LoRa.endPacket(true);           // asincrona: scrive un registro e torna

  const uint32_t limite = tempoDiVoloMs(strlen(pacchetto)) * (uint32_t)TX_GUARDIA_X
                        + (uint32_t)TX_GUARDIA_MS;
  const uint32_t t0     = millis();
  bool           finita = false;

  while (millis() - t0 < limite) {
    esp_task_wdt_reset();
    if (LoRa.beginPacket() == 1) { finita = true; break; }
    delay(1);
  }

