Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
  if (!finita)
    Serial.printf("[LoRa] ACK non concluso in %lu ms: il modulo non risponde.\n",
                  (unsigned long)limite);

  LoRa.receive();                 // subito di nuovo in ascolto
}

/*
 * seq, ts       : identificano il pacchetto confermato
 * allegaComando : si puo' estrarre un comando nuovo dalla coda
 * ripeti        : comando gia' consegnato da riallegare (ritrasmissione dello
 *                 stesso pacchetto), oppure nullptr
 */
static void inviaAck(uint32_t seq, uint32_t ts, bool allegaComando,
                     const ComandoInCoda* ripeti = nullptr) {
  char ack[PROTO_MAX_PAYLOAD + 1];

  /*
   * snprintf ritorna quanti caratteri AVREBBE scritto, non quanti ne ha
   * scritti davvero. Accumulando quel valore senza limitarlo, "pos" puo'
   * superare la dimensione del buffer e la sottrazione successiva va in
   * underflow (sono size_t), passando a snprintf una dimensione enorme.
   * Da qui in poi si scriverebbe oltre il buffer. Questa lambda tiene "pos"
   * dentro i limiti qualunque cosa succeda.
   */
  size_t pos = 0;
  auto accoda = [&](const char* fmt, auto... args) {
    if (pos >= sizeof(ack) - 1) return;
    int n = snprintf(ack + pos, sizeof(ack) - pos, fmt, args...);
    if (n < 0) return;
    pos = (size_t)n >= sizeof(ack) - pos ? sizeof(ack) - 1 : pos + (size_t)n;
  };

  accoda("%s;s=%lu", PROTO_PREFIX_ACK, (unsigned long)seq);

  uint32_t adesso = oraCorrente();
  if (adesso > 0) {
    accoda(";now=%lu", (unsigned long)adesso);
    accoda(";tz=%ld",  (long)offsetFuso());
  }

  if (ripeti) {
    accoda(";c=%lu;o=%s;a=%s", (unsigned long)ripeti->id, ripeti->opcode, ripeti->args);
    Serial.printf("[CMD] Riallego id=%lu %s: l'ACK che lo portava non era arrivato.\n",
                  (unsigned long)ripeti->id, ripeti->opcode);
  } else if (allegaComando && !codaVuota()) {
    ComandoInCoda cmd;
    if (codaEstrai(cmd)) {
      accoda(";c=%lu;o=%s;a=%s", (unsigned long)cmd.id, cmd.opcode, cmd.args);
      comandiConsegnati++;
      ackCmd       = cmd;
      ackCmdValido = true;
      ackCmdSeq    = seq;
      ackCmdTs     = ts;
      ackCmdMs     = millis();
    }
  }

  trasmettiAck(ack);

  Serial.printf("[LoRa] ACK -> %s\n", ack);
}

static void gestisciLoRa() {
  int sz = LoRa.parsePacket();
  if (sz <= 0) return;

  char buf[PROTO_MAX_PAYLOAD + 1];
  int  n = 0;
  while (LoRa.available() && n < (int)sizeof(buf) - 1) buf[n++] = (char)LoRa.read();
  buf[n] = '\0';

  ultimoRssi = LoRa.packetRssi();
  ultimoSnr  = LoRa.packetSnr();
  pacchettiRicevuti++;

  Serial.printf("\n[LoRa] #%lu (RSSI %d dBm, SNR %.1f dB, %d byte): %s\n",
                (unsigned long)pacchettiRicevuti, ultimoRssi, ultimoSnr, n, buf);

  // --- Parsing: v2 (chiave=valore) oppure v1 (CSV posizionale) -------------
  // Il supporto al v1 serve durante l'aggiornamento: sulla microSD del nodo
  // possono esserci record accodati dalla versione precedente del firmware.
  char        prefisso[12] = {0};
  PacchettoKV pkt;
  bool        ok;

  if (protoEV2(buf)) ok = pkt.parse(buf, prefisso, sizeof(prefisso));
  else               ok = protoParseV1(buf, pkt, prefisso, sizeof(prefisso));

  if (!ok || strcmp(prefisso, "GH1") != 0) {
    Serial.println(F("[LoRa] Pacchetto non riconosciuto, ignorato."));
    pacchettiScartati++;
    return;
  }

  uint32_t seq = pkt.valoreU("s", 0);
  uint32_t ts  = pkt.valoreU("t", 0);

  // --- Duplicato? Si conferma comunque, ma non si ripubblica ---------------
  // Il dato e' gia' arrivato al broker (ricorda() scatta solo dopo l'eco):
  // si e' perso l'ACK. Se quell'ACK portava un comando, glielo si riallega.
  if (giaVisto(seq, ts)) {
    Serial.println(F("[LoRa] Duplicato (ACK perso in precedenza): confermo senza ripubblicare."));
    bool stessoPacchetto = ackCmdValido && seq == ackCmdSeq && ts == ackCmdTs &&
                           (millis() - ackCmdMs) < ACK_RIPETIBILE_MS;
    inviaAck(seq, ts, false, stessoPacchetto ? &ackCmd : nullptr);
    return;
  }

  // --- Fresco o storico? ---------------------------------------------------
  // Un record ripescato dal backlog non deve finire su serra/nodo/stato:
  // il nodo trasmette prima il pacchetto attuale e poi la coda arretrata,
  // quindi Home Assistant finirebbe per mostrare come "valore corrente" una
  // lettura vecchia. Dal firmware 2.5.0 il nodo marca quei record con bk=1;
  // per quelli dei firmware precedenti valgono l'eta' e il confronto con
  // l'ultimo pacchetto fresco (vedi config.h).
  // ts == 0 significa che il nodo non conosce ancora l'ora: e' un pacchetto
  // fresco, e anzi ha bisogno del "now" nell'ACK.
  uint32_t adesso = oraCorrente();
  bool storico = pkt.ha("bk") ||
                 ((ts > 0) && (adesso > 0) && (adesso > ts) &&
                  ((adesso - ts) > SOGLIA_STORICO_SEC)) ||
                 ((ts > 0) && (ultimoTsFresco > 0) &&
                  (ts + STORICO_MARGINE_SEC < ultimoTsFresco));

  const char* topic = storico ? TOPIC_STORICO : TOPIC_STATO;

  /*
   * 900 byte e non 640: un pacchetto LoRa pieno (250 byte, fino a 28 campi)
   * espanso in JSON con virgolette e nomi di chiave puo' superare
   * abbondantemente i 640, e il buffer precedente era piu' piccolo di quello
   * che il protocollo stesso permette di ricevere.
   */
  char json[900];
  costruisciJson(pkt, json, sizeof(json), ultimoRssi, ultimoSnr);
  Serial.printf("[MQTT] %s <- %s\n", topic, json);

  // Retained solo per lo stato attuale: dopo un riavvio di Home Assistant i
  // sensori hanno subito un valore invece di restare vuoti fino al risveglio
  // successivo del nodo (fino a 15 minuti di buco).
  bool pubblicato = mqtt.connected() &&
                    mqtt.publish(topic, (const uint8_t*)json, strlen(json), !storico);

  if (!pubblicato) {
    // Niente ACK: la serra conserva il dato su microSD e lo rimandera'.
    // E' cosi' che la catena "nessun dato perso" resta intatta.
    Serial.println(F("[MQTT] Pubblicazione fallita: NIENTE ACK, la serra terra' il dato su SD."));
    return;
  }

  // --- Esito di un comando eseguito dal nodo -------------------------------
  // Prima dell'eco, cosi' l'eco conferma anche lui.
  if (pkt.ha("res")) {
    const char* det = pkt.valore("det");
    codaPubblicaEsito(pkt.valoreU("res", 0), pkt.valoreU("rc", 0), det ? det : "");
  }

  // --- Il broker ha ricevuto davvero? --------------------------------------
  if (!confermaDalBroker(seq)) {
    ecoMancate++;
    Serial.printf("[MQTT] Eco non tornata entro %lu ms: NIENTE ACK, il nodo "
                  "ritrasmettera' o terra' il dato su SD (eco mancate: %lu).\n",
                  (unsigned long)ECO_TIMEOUT_MS, (unsigned long)ecoMancate);
    return;
  }

  // Solo adesso il pacchetto e' consegnato: una sua ritrasmissione e' un
  // duplicato da non ripubblicare.
  ricorda(seq, ts);

